spec/cassettes/User_views_payment_index_page/after_at_least_1_payment_has_been_made/shows_payment_history.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Fri, 17 Oct 2014 19:05:09 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM8346bfaa563011e4bb8102a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.27
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKBA5TXlAJCwlTVlECBA5TUx0WAVBQT0ISV14GDwwGVAdSDVQBVAEBARQbQQACVEBVOQ==
      Content-Length:
      - '1291'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-10-17T19:05:09.160764Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-17T19:05:09.160766Z",
              "href": "/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA401rRlKvcdMXxuvnH6GhX2"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Fri, 17 Oct 2014 19:05:09 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 17 Oct 2014 19:05:09 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM83a7c0ca563011e4867106429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.27
      Content-Length:
      - '498'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-10-17T19:05:09.160764Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-17T19:05:09.160766Z",
              "href": "/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA401rRlKvcdMXxuvnH6GhX2"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Fri, 17 Oct 2014 19:05:09 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2/verifications
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 17 Oct 2014 19:05:21 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM83d49280563011e4a4f602b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.27
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA401rRlKvcdMXxuvnH6GhX2"
              },
              "href": "/verifications/BZ4d0cN79wy2R0SYVN5ct9qo",
              "created_at": "2014-10-17T19:05:20.699561Z",
              "attempts_remaining": 3,
              "updated_at": "2014-10-17T19:05:21.013690Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ4d0cN79wy2R0SYVN5ct9qo"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Fri, 17 Oct 2014 19:05:21 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 17 Oct 2014 19:05:21 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM8af91fea563011e4892e0230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.27
      Content-Length:
      - '520'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ4d0cN79wy2R0SYVN5ct9qo"
              },
              "can_credit": true,
              "created_at": "2014-10-17T19:05:09.160764Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-17T19:05:09.160766Z",
              "href": "/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA401rRlKvcdMXxuvnH6GhX2"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Fri, 17 Oct 2014 19:05:22 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ4d0cN79wy2R0SYVN5ct9qo
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 17 Oct 2014 19:05:22 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM8b273b8c563011e4af160230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.27
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA401rRlKvcdMXxuvnH6GhX2"
              },
              "href": "/verifications/BZ4d0cN79wy2R0SYVN5ct9qo",
              "created_at": "2014-10-17T19:05:20.699561Z",
              "attempts_remaining": 3,
              "updated_at": "2014-10-17T19:05:21.013690Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ4d0cN79wy2R0SYVN5ct9qo"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Fri, 17 Oct 2014 19:05:22 GMT
- request:
    method: put
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ4d0cN79wy2R0SYVN5ct9qo
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BA401rRlKvcdMXxuvnH6GhX2"},"created_at":"2014-10-17T19:05:20.699561Z","attempts_remaining":3,"updated_at":"2014-10-17T19:05:21.013690Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZ4d0cN79wy2R0SYVN5ct9qo","amount_1":"1","amount_2":"1"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 17 Oct 2014 19:05:22 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM8b507ede563011e4ae9d02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.27
      Content-Length:
      - '601'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BA401rRlKvcdMXxuvnH6GhX2"
              },
              "href": "/verifications/BZ4d0cN79wy2R0SYVN5ct9qo",
              "created_at": "2014-10-17T19:05:20.699561Z",
              "attempts_remaining": 2,
              "updated_at": "2014-10-17T19:05:22.428636Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZ4d0cN79wy2R0SYVN5ct9qo"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Fri, 17 Oct 2014 19:05:22 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 17 Oct 2014 19:05:22 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM8b872880563011e49a3902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.27
      Content-Length:
      - '521'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ4d0cN79wy2R0SYVN5ct9qo"
              },
              "can_credit": true,
              "created_at": "2014-10-17T19:05:09.160764Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-17T19:05:22.426804Z",
              "href": "/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BA401rRlKvcdMXxuvnH6GhX2"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Fri, 17 Oct 2014 19:05:23 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA401rRlKvcdMXxuvnH6GhX2/debits
    body:
      encoding: UTF-8
      string: '{"amount":1,"appears_on_statement_as":"Epicodus tuition"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 17 Oct 2014 19:05:23 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM8bb37638563011e4af3b06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.27
      Content-Length:
      - '1059'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": null,
              "links": {
                "customer": null,
                "source": "BA401rRlKvcdMXxuvnH6GhX2",
                "card_hold": null,
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-10-17T19:05:23.220317Z",
              "created_at": "2014-10-17T19:05:23.041014Z",
              "transaction_number": "WVNH-URY-6QQD",
              "failure_reason": null,
              "currency": "USD",
              "amount": 1,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD4fDnz7vGuwMzqv60lYYWT6",
              "appears_on_statement_as": "BAL*Epicodus tuition",
              "id": "WD4fDnz7vGuwMzqv60lYYWT6"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.order": "/orders/{debits.order}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.events": "/debits/{debits.id}/events",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.card_hold": "/holds/{debits.card_hold}"
          }
        }
    http_version: 
  recorded_at: Fri, 17 Oct 2014 19:05:23 GMT
recorded_with: VCR 2.9.3
